#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mgoogle_service_account.tf-sa: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.enabled_apis["iam.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/iam.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["serviceusage.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/serviceusage.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/cloudresourcemanager.googleapis.com][0m
[0m[1mgoogle_storage_bucket.resume_bucket: Refreshing state... [id=resume_bucket02934502349][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/owner"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/owner/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_service_account_key.sa_key: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com/keys/f7499d28ed355d26be2af06f1f0c893d3e366500][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/storage.admin"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/storage.admin/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # google_storage_bucket.resume_bucket[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "google_storage_bucket" "resume_bucket" {
        [1m[0mid[0m[0m                          = "resume_bucket02934502349"
        [1m[0mname[0m[0m                        = "resume_bucket02934502349"
        [90m# (10 unchanged attributes hidden)[0m[0m

      [32m+[0m [0mcors {
          [32m+[0m [0m[1m[0mmax_age_seconds[0m[0m = 3600
          [32m+[0m [0m[1m[0mmethod[0m[0m          = [
              [32m+[0m [0m"GET",
              [32m+[0m [0m"HEAD",
              [32m+[0m [0m"PUT",
              [32m+[0m [0m"POST",
              [32m+[0m [0m"DELETE",
            ]
          [32m+[0m [0m[1m[0morigin[0m[0m          = [
              [32m+[0m [0m"*",
            ]
          [32m+[0m [0m[1m[0mresponse_header[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # google_storage_bucket_access_control.public_rule[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket_access_control" "public_rule" {
      [32m+[0m [0m[1m[0mbucket[0m[0m = "resume_bucket02934502349"
      [32m+[0m [0m[1m[0mdomain[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0memail[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mentity[0m[0m = "allUsers"
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m   = "READER"
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jamesfricker, Action: `pull_request`, Working Directory: ``, Workflow: `deployment`*